# Пользователь вводит сторону квадрата. Найдите периметр и площадь квадрата.

storona = int(input("Enter square side: "))
print("Perimetr: ", storona * 4)
print("Ploshad: ", storona ** 2)
